<template>
	<view class="agree-bg">
		<view class="title">自动续费服务协议</view>
		<view class="h1">1. 服务条款的确认和接纳</view>
		<view class="p">为满足您对会员权益类商品连续购买的需求，福禄充值小程序（以下简称“本小程序”，小程序所有权和运营权归武汉福禄网络科技有限公司所有）推出自动续费服务，相关服务请关注本协议约定。若需购买，请点击 “自动续费
			”选项开通本服务，本协议即构成您使用本小程序所提供的本自动续费服务之先决条件，除非您接受本协议条款，否则您无权使用本服务。您选择使用本服务行为将视为同意接受本协议的约束。当您使用自动续费服务时，您的使用行为将被视为其对该单项服务的相关条款以及本小程序在该单项服务中所发出的各类公告之同意。</view>
		<view class="h1">2. 所有权与使用权</view>
		<view class="p">自动续费服务涉及到的一切网络服务之所有权以及相关之知识产权均归本小程序依法所有，受中华人民共和国法律及国际公约的依法保护，您不因使用自动续费服务而自动获得前述的任一或全部权利。而且，本小程序可以在法定或依据《用户注册协议》对本服务协议中的任一或全部条款进行修改，或对自动续费服务进行调整，对上述修改或调整，本小程序会在网站上予以公告，并自公告之日起7日后生效。本小程序强烈建议您，定期关注《用户注册协议》及本协议项下的条款，当您认为本小程序对所述的《用户注册协议》及本协议项下的调整不可接受时，请及时终止对本小程序所提供之相关服务，特别是本自动续费服务的使用。</view>
		<view class="h1">3. 自动续费服务类型及服务内容范围</view>
		<view class="p">本小程序自动续费服务会根据用户需求不断增加新的自动续订服务。您通过使用自动续费服务，可以定期获得对应的自动续费充值服务。</view>
		<view class="p">为保障您的会员权益的连续性，本小程序会提前48小时开始尝试代扣充值，请您务必注意，在您选择终止本自动续订服务前本小程序在此期间已代扣充值成功的，对于已扣除的费用，本小程序不予退还。到账品牌会员权益有效期以相应品牌官方产品为准。</view>
		<view class="h1">4. 服务说明</view>
		<view class="p item">4.1
			本服务是出于您对于自动续费的需求，在您已开通本服务的前提下，避免您因疏忽或其他原因导致未能及时续费造成损失而推出的服务，您授权本小程序可在您已生效的会员有效期即将过期时，从与本小程序绑定的支付宝账户中代扣下一个计费周期费用，该服务实现的前提是您已将您的会员账号与支付宝账户绑定，且可成功从其上述账户中扣款。</view>
		<view class="p item">4.2
			自动续费具体指，基于4.1的前提，本小程序通过上述账户收取您下一计费周期本小程序自动续订产品费用的扣费方式，您需保证本小程序可以从上述账户扣款成功，因上述账户中可扣款余额不足导致的续费失败，由您自行承担责任。</view>
		<view class="p item">4.3
			如在扣费过程出现差错，本小程序和您应密切配合查明原因，各自承担己方过错造成的损失；若因双方各自存在不均等过错造成的损失，由双方按过错的程度承担相应责任；双方共负责任的，由双方均摊责任。因本小程序造成的已扣款成功但未充值到账的情况，本小程序将在7个工作日内针对您已扣取的费用进行退款操作。</view>
		<view class="p item">4.4本小程序向您提供的本服务均仅限于在本小程序平台使用，本小程序平台外的付款或任何以恶意破解等非法手段将本小程序提供的本服务内容与本小程序平台分离的行为，均不属于本协议中约定的本服务。由此引起的一切法律后果由行为人负责，本小程序将依法追究行为人的法律责任。</view>
		<view class="h1">5. 自动续费服务的开通</view>
		<view class="p">对于所选择的支付渠道，您有义务确保定期关注并确保其于该支付方式的账号项下有充足的余额用于满足自动续费服务的应用。如因前述原因瑕疵（包括但不限于：余额不足、余额不足以满足用户选择多个自动续费服务）而致使无法满足自动续费服务的应用，则本小程序有权停止您通过自动续费服务所接入的本小程序服务。</view>
		<view class="h1">6. 自动续费服务有效期</view>
		<view class="p">除非本小程序另行指定，否则您获得的自动续费服务均为长期有效。</view>
		<view class="p">本小程序将于您所选择的本小程序服务期届满前向您以站内信或推送消息等方式发送自动续费服务续费提示，如果您不对该信息进行确认，或所回复确认之信息未尽符合本小程序的系统要求，则本小程序有权视您委托本小程序通过您默认的支付方式续取相应的服务费用。</view>
		<view class="p">本服务由您自主选择是否取消，若您选择不取消，则视为您同意本小程序按照本协议进行不定期的扣款尝试，一旦扣款成功，本小程序将为您开通下一个计费周期的自动续订服务。若在自动续费时/之前，本小程序续订服务价格发生调整，以本小程序当下运营定价策略为准。</view>
		<view class="p">特别提醒您：当您选择使用自动续费服务后，通过自动续费服务委托本小程序在您默认的支付方式所支付的费用，本小程序将视您选择认购了本小程序的相关付费服务。因此，本小程序将不以任何方式对您所支付的费用予以退还。</view>
		<view class="h1">7. 自动续费服务的终止</view>
		<view class="p item">7.1 当发生以下情况中的任意一种，自动续费服务将终止</view>
		<view class="p item">7.1.1 您自主选择退订本服务解约流程，即关闭自动续订会员服务步骤：登录“支付宝-我的-设置-支付设置”，进入“免密支付/自动扣款”退订。</view>
		<view class="p item">7.1.2 因违反本小程序用户协议等原因导致的账户被冻结，或账户被注销；</view>
		<view class="p item">7.1.3因违反对应品牌会员平台协议等原因导致的充值账号被冻结，或账户被注销；</view>
		<view class="p item">7.1.4本小程序根据自身经营策略的需要，提前30日通知您解除本协议。</view>
		<view class="p">温馨提示：自动续费服务取消成功后，不影响您当期已生效的会员权益，会员权益到期后将不再续费。</view>
		<view class="p">您在选择终止本服务前已经委托本小程序自动续订扣款的指令仍然有效，本小程序对于基于该指令扣除的费用不予退还。</view>
		<view class="h1">8. 争议解决和法律适用</view>
		<view class="p">本小程序与您应通过友好协商解决本协议履行过程中产生的争议，经协商无法解决的，任何一方均有权将争议提交至被告方所在地人民法院诉讼解决。本协议的解释、效力和执行等均适用中华人民共和国法律。</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {

			};
		}
	}
</script>

<style lang="less">
	.agree-bg {
		background: #F6F6F6;
		width: 750rpx;
		min-height: 100vh;
		padding: 60rpx 32rpx;

		.title {
			height: 40rpx;
			font-size: 28rpx;
			font-weight: 700;
			color: #333;
			line-height: 40rpx;
			text-align: center;
			margin-bottom: 36rpx;
		}

		.h1 {
			font-size: 28rpx;
			color: #444;
			line-height: 40rpx;
			margin-bottom: 16rpx;
			font-weight: 700;
		}

		.p {
			margin-bottom: 48rpx;
			font-size: 28rpx;
			color: #666;
			line-height: 48rpx;

			&.item {
				margin-bottom: 16rpx;
			}
		}
	}
</style>
